<template>
  <header>
    
  <RouterView />

    <icon-logo />
    <FilmIcon class="h-5 w-5 fill-blue-300 stroke-blue-600" />
    <RouterLink to="/">Accueil</RouterLink>

    <nav class="fixed bottom-0 w-full h-[96px] flex flex-row justify-evenly items-center rounded-t-2xl bg-gray-300">
      <RouterLink to="/create" class="no-underline flex flex-col content-center justify-items-center">
        <svg
          width="38"
          height="40"
          viewBox="0 0 38 40"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
          preserveAspectRatio="none"
        >
          <path
            d="M29.7474 5.41125H8.06395C6.35317 5.41125 4.96631 6.86889 4.96631 8.66697V31.457C4.96631 33.2551 6.35317 34.7127 8.06395 34.7127H29.7474C31.4582 34.7127 32.8451 33.2551 32.8451 31.457V8.66697C32.8451 6.86889 31.4582 5.41125 29.7474 5.41125Z"
            stroke="black"
            stroke-width="4"
            stroke-linecap="round"
            stroke-linejoin="round"
          ></path>
          <path
            d="M18.9058 13.5505V26.5734"
            stroke="black"
            stroke-width="4"
            stroke-linecap="round"
            stroke-linejoin="round"
          ></path>
          <path
            d="M12.7104 20.062H25.101"
            stroke="black"
            stroke-width="4"
            stroke-linecap="round"
            stroke-linejoin="round"
          ></path>
        </svg>
        <p class="text-xs font-bold text-center justify-self-end">Créer</p>
      </RouterLink>
      <RouterLink to="/join" class="no-underline flex flex-col content-center justify-items-center">
        <svg xmlns="http://www.w3.org/2000/svg" width="45" height="35" viewBox="0 0 45 35" class="justify-self-center"><path d="M0,24.33V0H18.33c.34,2.46.64,4.92,1,7.37.06.33.62.58.94.87.2-.41.61-.84.56-1.21-.35-2.35-.79-4.69-1.2-7h6c-.34,2.34-.72,4.68-1,7-.05.38.34.81.53,1.21.33-.29.9-.55.95-.89.34-2.44.57-4.9.84-7.35H45V35H28c.83-.53,1.62-1.43,2.48-1.49a3.48,3.48,0,0,0,2.87-1.85,12.81,12.81,0,0,1,2.59-2.16A.59.59,0,0,0,36,29c-.44-1.64.73-2.23,1.88-2.64a5.19,5.19,0,0,0,2.45,0c1.15-.39,2.19-1.06,3.33-1.51s1.18-1.08.67-2.07c-2-3.84-3.94-7.69-5.85-11.57-.58-1.2-1.22-1.23-2.19-.52a15.72,15.72,0,0,1-2.38,1.52c-1.79.83-3.61,1.27-5.51.15a7.82,7.82,0,0,0-9,.27,4.76,4.76,0,0,1-2.46.62,18.79,18.79,0,0,1-9.5-2.46c-1.95-1-2.07-.9-2.81,1.12Q2.3,18.13,0,24.33ZM30,9.16c.47-.16.69-.17.76-.28,1-1.57,2-3.15,3-4.77.08-.14-.22-.72-.4-.75a1.15,1.15,0,0,0-1,.3c-1,1.36-1.86,2.76-2.67,4.2C29.52,8.14,29.85,8.69,30,9.16ZM12.12,3.57c-.1.8-.35,1.36-.17,1.68a25.17,25.17,0,0,0,2.22,3.28c.22.27.83.23,1.25.33,0-.4.18-.9,0-1.19C14.78,6.58,14,5.54,13.3,4.51A7.67,7.67,0,0,0,12.12,3.57Z" style="fill:#fff"/><path d="M0,24.33Q2.3,18.12,4.6,11.9c.74-2,.86-2.17,2.81-1.12a18.79,18.79,0,0,0,9.5,2.46,4.76,4.76,0,0,0,2.46-.62,7.82,7.82,0,0,1,9.05-.27c1.9,1.12,3.72.68,5.51-.15a15.72,15.72,0,0,0,2.38-1.52c1-.71,1.61-.68,2.19.52,1.91,3.88,3.87,7.73,5.85,11.57.51,1,.47,1.62-.67,2.07S41.5,26,40.35,26.35a5.19,5.19,0,0,1-2.45,0c-1.15.41-2.32,1-1.88,2.64a.59.59,0,0,1-.08.48,12.81,12.81,0,0,0-2.59,2.16,3.48,3.48,0,0,1-2.87,1.85c-.86.06-1.65,1-2.48,1.49H18.33c-1.3-.74-2.63-1.43-3.89-2.23a48.59,48.59,0,0,1-4-2.82c-.77-.6-1.33-1.45-2.06-2.1a5.19,5.19,0,0,0-1.81-1.21C4.41,26,2.2,25.54,0,25Zm9,1.58,0-.56A21.42,21.42,0,0,1,12.24,25a8.5,8.5,0,0,1,2.25.71c1.39.48,2.8.95,4.18,1.48.33.13.55.52.83.79a15.44,15.44,0,0,0,1.74,1.61c1.55,1.08,3.13,2.13,4.77,3.07a5.49,5.49,0,0,0,1.86.35,5.44,5.44,0,0,0-.82-1.75c-1.69-1.59-3.52-3-5.23-4.62-.36-.33-.42-1-.62-1.49.57.11,1.28,0,1.67.36,2.32,1.89,4.53,3.91,6.86,5.8.4.32,1.15.23,1.73.33-.17-.61-.14-1.43-.53-1.8-1.77-1.67-3.69-3.19-5.5-4.83-.56-.52-1.88-.84-1-2,.13-.17,1.42.33,2,.78,2.08,1.66,4,3.48,6.12,5.13.39.31,1.17.15,1.77.21-.21-.52-.29-1.19-.66-1.54Q29,23.27,24.32,19c-1.25-1.12-1.81-.94-2.83.27a8.56,8.56,0,0,1-2.59,2.22,2.61,2.61,0,0,1-3.35-.59c-.88-1.1-.35-2.16.22-3.23a27.14,27.14,0,0,0,1.13-2.88l-5.39-.37L7.61,25.12Zm27.85-1.09L32.4,14.38a7,7,0,0,1-5.7-1.05c-1.88-1.14-3.82-.67-5.85.22-2.62,1.17-2.75,3.81-4,5.77,0,0,.93.91,1.06.82a8.41,8.41,0,0,0,2.37-1.92c1.25-1.7,3-2.1,4.66-.76,1.12.9,2.17,1.89,3.23,2.86l6.62,6ZM6.17,12.29,1.94,24.11l3.74,1.08a84.8,84.8,0,0,0,3.23-8.38C10,13,10.44,13.89,6.53,12.18,6.49,12.16,6.43,12.21,6.17,12.29Zm36.7,11.14L37.14,12.11a15.46,15.46,0,0,0-1.89,1.2c-.36.3-.87.89-.79,1.2a31.93,31.93,0,0,0,4.9,10.56Zm-25.6,4.42c-.79,1.31-1.4,2.22-1.88,3.2-.06.13.5.57.77.86.71-.84,1.46-1.65,2.09-2.56C18.34,29.22,17.81,28.66,17.27,27.85Zm-4,2.83c.69-1,1.23-1.75,1.64-2.53.06-.13-.48-.56-.74-.85a21.65,21.65,0,0,0-1.68,2C12.4,29.49,12.86,30,13.27,30.68Zm8,2.69,2.76.34.11-.44-2-1.62Zm-3-.37.66.32c.23-.9,2-1.14.91-3.07Z"/><path d="M0,25c2.2.54,4.41,1,6.58,1.64a5.19,5.19,0,0,1,1.81,1.21c.73.65,1.29,1.5,2.06,2.1a48.59,48.59,0,0,0,4,2.82c1.26.8,2.59,1.49,3.89,2.23H0Z" style="fill:#fff"/><path d="M19.67,0c.41,2.34.85,4.68,1.2,7,.05.37-.36.8-.56,1.21-.32-.29-.88-.54-.94-.87-.4-2.45-.7-4.91-1-7.37Z"/><path d="M27,0c-.27,2.45-.5,4.91-.84,7.35-.05.34-.62.6-.95.89-.19-.4-.58-.83-.53-1.21.27-2.35.65-4.69,1-7Z"/><path d="M30,9.16c-.12-.47-.45-1-.29-1.3.81-1.44,1.72-2.84,2.67-4.2a1.15,1.15,0,0,1,1-.3c.18,0,.48.61.4.75-1,1.62-2,3.2-3,4.77C30.66,9,30.44,9,30,9.16Z"/><path d="M12.12,3.57a7.67,7.67,0,0,1,1.18.94c.74,1,1.48,2.07,2.13,3.16.17.29,0,.79,0,1.19-.42-.1-1-.06-1.25-.33A25.17,25.17,0,0,1,12,5.25C11.77,4.93,12,4.37,12.12,3.57Z"/><path d="M9,25.91l-1.38-.79,3.9-10.66,5.39.37a27.14,27.14,0,0,1-1.13,2.88c-.57,1.07-1.1,2.13-.22,3.23a2.61,2.61,0,0,0,3.35.59,8.56,8.56,0,0,0,2.59-2.22c1-1.21,1.58-1.39,2.83-.27q4.71,4.23,9.32,8.55c.37.35.45,1,.66,1.54-.6-.06-1.38.1-1.77-.21-2.09-1.65-4-3.47-6.12-5.13-.55-.45-1.84-.95-2-.78-.89,1.13.43,1.45,1,2,1.81,1.64,3.73,3.16,5.5,4.83.39.37.36,1.19.53,1.8-.58-.1-1.33,0-1.73-.33-2.33-1.89-4.54-3.91-6.86-5.8-.39-.32-1.1-.25-1.67-.36.2.51.26,1.16.62,1.49,1.71,1.58,3.54,3,5.23,4.62A5.44,5.44,0,0,1,27.87,33,5.49,5.49,0,0,1,26,32.63c-1.64-.94-3.22-2-4.77-3.07A15.44,15.44,0,0,1,19.5,28c-.28-.27-.5-.66-.83-.79-1.38-.53-2.79-1-4.18-1.48A8.5,8.5,0,0,0,12.24,25,21.42,21.42,0,0,0,9,25.35Z" style="fill:#fff"/><path d="M36.84,24.82l-2.07,1.54-6.62-6c-1.06-1-2.11-2-3.23-2.86-1.66-1.34-3.41-.94-4.66.76a8.41,8.41,0,0,1-2.37,1.92c-.13.09-1.08-.78-1.06-.82,1.27-2,1.4-4.6,4-5.77,2-.89,4-1.36,5.85-.22a7,7,0,0,0,5.7,1.05Z" style="fill:#fff"/><path d="M6.17,12.29c.26-.08.32-.13.36-.11,3.91,1.71,3.45.8,2.38,4.63a84.8,84.8,0,0,1-3.23,8.38L1.94,24.11Z" style="fill:#fff"/><path d="M42.87,23.43l-3.51,1.64a31.93,31.93,0,0,1-4.9-10.56c-.08-.31.43-.9.79-1.2a15.46,15.46,0,0,1,1.89-1.2Z" style="fill:#fff"/><path d="M17.27,27.85c.54.81,1.07,1.37,1,1.5-.63.91-1.38,1.72-2.09,2.56-.27-.29-.83-.73-.77-.86C15.87,30.07,16.48,29.16,17.27,27.85Z" style="fill:#fff"/><path d="M13.27,30.68c-.41-.69-.87-1.19-.78-1.34a21.65,21.65,0,0,1,1.68-2c.26.29.8.72.74.85C14.5,28.93,14,29.65,13.27,30.68Z" style="fill:#fff"/><path d="M21.31,33.37l.91-1.72,2,1.62-.11.44Z" style="fill:#fff"/><path d="M18.27,33l1.57-2.75c1.07,1.93-.68,2.17-.91,3.07Z" style="fill:#fff"/></svg>
        <p
          class="text-xs font-bold text-center justify-self-end"
        >
          Rejoindre
        </p>
      </RouterLink>
      <RouterLink to="/profile" class="no-underline flex flex-col content-center justify-items-center">
        <svg xmlns="http://www.w3.org/2000/svg" width="34.33" height="35" viewBox="0 0 34.33 35"><path d="M34.33,35H0V0H34.33ZM17.67,32.79c3.74,0,7.47,0,11.21,0,1.37,0,2.09-.55,1.72-1.86a22.23,22.23,0,0,0-2.06-5.82c-3.06-4.81-7.89-5.79-13.16-5.24A12,12,0,0,0,4.64,30.83c-.09,1.41.33,2,1.81,2C10.19,32.75,13.93,32.79,17.67,32.79ZM25.2,10.17a7.56,7.56,0,0,0-7.59-7.69A7.68,7.68,0,0,0,10,10.06a7.62,7.62,0,0,0,7.56,7.58A7.52,7.52,0,0,0,25.2,10.17Z" style="fill:#fff"/><path d="M17.67,32.79c-3.74,0-7.48,0-11.22,0-1.48,0-1.9-.58-1.81-2A12,12,0,0,1,15.38,19.89c5.27-.55,10.1.43,13.16,5.24A22.23,22.23,0,0,1,30.6,31c.37,1.31-.35,1.88-1.72,1.86C25.14,32.76,21.41,32.79,17.67,32.79ZM7,30.58h21.3c-.7-5.78-5-8.83-12-8.54C11.3,22.24,7.17,26,7,30.58Z"/><path d="M25.2,10.17a7.52,7.52,0,0,1-7.62,7.47A7.62,7.62,0,0,1,10,10.06a7.68,7.68,0,0,1,7.59-7.58A7.56,7.56,0,0,1,25.2,10.17Zm-13-.09a5.41,5.41,0,0,0,5.45,5.41,5.48,5.48,0,0,0,5.39-5.34,5.42,5.42,0,1,0-10.84-.07Z"/><path d="M7,30.58C7.17,26,11.3,22.24,16.29,22c7-.29,11.33,2.76,12,8.54Z" style="fill:#fff"/><path d="M12.23,10.08a5.42,5.42,0,1,1,5.45,5.41A5.45,5.45,0,0,1,12.23,10.08Z" style="fill:#fff"/></svg>
        <p
          class="text-xs font-bold text-center justify-self-end"
        >
          Profil
        </p>
      </RouterLink>
    </nav>
  </header>
</template>

<script>
import IconLogo from "./components/icons/IconLogo.vue";
import { FilmIcon } from "@heroicons/vue/outline";
// Bibliothèques Firebase  : import des fonctions
//  signInWithEmailAndPassword : Authentification avec email et mot de passe
//  getAuth : Fonction générale d'authentification
//  signOut : Se deconnecter
//  onAuthStateChanged : connaitre le statut de l'utilisateur (connecté ou non)
import { getAuth, signInWithEmailAndPassword, signOut, onAuthStateChanged } from 'https://www.gstatic.com/firebasejs/9.7.0/firebase-auth.js'

// Bibliothèque Firestore : import des fonctions
import { 
    getFirestore, 
    collection, 
    doc, 
    getDocs, 
    addDoc, 
    updateDoc, 
    deleteDoc, 
    onSnapshot } from 'https://www.gstatic.com/firebasejs/9.7.0/firebase-firestore.js'

export default {
  components: { IconLogo, FilmIcon },
  data(){ // Données de la vue
          return{                
              user:{          // user se connectant
                  email:null,
                  password:null
              },
              message:null, // Message de connexion
          }
      },

      mounted(){ // Montage de la vue
          // Rechercher si un user est déjà connecté
              let user = getAuth().currentUser;
              if(user){
                  this.user = user;
                  this.message = "User déjà connecté : "+this.user.email;
              }else{
                  this.message = "User non connecté : "+this.user.email;
              }
      },

      methods:{
          onCnx(){                
              // Se connecter avec user et mot de passe           
              signInWithEmailAndPassword(getAuth(), this.user.email, this.user.password)
              .then((response)=>{
                  // Connexion OK
                  console.log('user connecté', response.user);
                  this.user = response.user;
                  this.message = "User connecté : "+this.user.email;
              })
              .catch((error) =>{
                  // Erreur de connexion
                  console.log('Erreur connexion', error);
                  this.message = "Erreur d'authentification";
              })
          },
          onDcnx(){
              // Se déconnecter
              signOut(getAuth())
              .then(response =>{
                  this.user = getAuth().currentUser;
                  this.user = {
                      email:null,
                      password:null
                  };
                  console.log("user deconnecté ", this.user);        
                  this.message = 'user non connecté';
              })
              .catch(error=>{
                  console.log('erreur deconnexion ', error);
              })

          },

      }
};


</script>